Tekla Open API Reference for Tekla Structures 2025
Events.LayoutTableModified Event
 The event is never raised
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event LayoutTableModifiedDelegate LayoutTableModified
Public Event LayoutTableModified As LayoutTableModifiedDelegate
Value
Type: LayoutTableModifiedDelegate
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace